#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include<string.h>
////if语句   有if else格式    或者      if -- else if--else格式
//int main()
//{
//	int age = 30;
//	if (age < 18)
//	{
//		printf("未成年\n");
//	}
//	else if (age>=18 && age<60)        //18<=age<60这样写错误，因为只要>=18与<60有一个成立即可，必须用并且&&来限定
//	{
//		printf("成年\n");
//	}      //这个大括号不用分号;
//
//
//	else             //使用else且没有if时,就是其他任何情况的意思，不可以用（）括号来限定条件
//	{
//		printf("老年\n");
//	}
//
//
//	return 0;
//}

//
//
//
//    //当俩个整型变量进行比较时，把常量放左边
//int main()
//{
//    int a = 5;
//    if (666 == a)                                 //不写成（a==666），因为=是赋值的意思，==才是比较，若是少打一个=，写成666=a会报错（因为常量666不可以被赋值），若是写成a=666，则不会报错，不利于查错
//        printf("well\n");
//
//
//
//
//    return 0;
//}


//
//      //练习：判断奇偶数
//int main()
//{
//    int num = 17;                 //%表示余数
//    if (num % 2 == 1)     //等于是==，不是=（赋值），少一个=会报错
//        printf("奇数");
//    else
//    {
//        printf("偶数");
//    }
//
//
//    return 0;
//}
    



      //练习：输出1到100间的奇数(用for循环）
//int main()      //从1加，每次加1
//{
//    int a = 0;
//   for (a = 1; a <= 100; a++)    //间隔用;不用,
//    {
//        if (a % 2 == 1)
//        {
//            printf("%d\n", a);
//        }
//    }
//
//
//
//
//
//
//    return 0;
//}


//
//int main()      //从1加，每次加2
//{
//    int a = 0;
//    for (a = 1; a <= 100; a+=2)
//    {
//        if (a % 2 == 1)
//        {
//            printf("%d\n", a);
//        }
//    }
//
//
//
//
//
//
//    return 0;
//}


//
//int main()      //while循环
//{
//    int a = -1;      
//    while ( a <= 100)
//    {
//        a+=2;            //从-1开始，但是不包括-1（这样是先加后打印）
//        if (a % 2 == 1)
//        {
//            printf("%d ", a);     //没有用\n则要习惯%d后面空一格，不然会挤在一起
//        }
//
//
//
//    }
//    return 0;
//}

int main()
{
    int i = 1;
    while (i <= 100)
    {
        if (i % 2 == 1)
        {
            printf("%d ", i);
        }
        i += 2;            //先打印后加2


    }



    return 0;
}


















































































































































































