#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include<string.h>
                      //移位操作符<<或者>>（移动二进制位，左移一位*2，右移一位/2

//
//
//                  //位操作符（他们的操作数都必须为整数
//               //按位与&    ，按位或|        ，       //按位是按二进制位
//int main() {
//    int a = 3, b = 5;          //3二进制是.......00011
//    int c = a & b;              //5是...........000101
//    int d = a | b;                           //&与是一起为1才取1，所以3与5的&是......000001即是十进制的1，或则是....000111，即7
//    printf("%d     %d\n", c,d);
//
//
//             //按位异或^ ，即相同为0，不同为1
//    int e = a ^ b;              //.......00011
//    printf("%d\n", e);          //......000101                俩个异或后为.....000110即6
//
//
//    return 0;
//}


                   //不使用临时变量交换a,b
//             //方法一，（缺点，数字太大会溢出）
//int main() {
//    int a = 3, b = 5;
//    a = a + b;
//    b = a - b;  //这样b就变成最开始的a
//    a = a - b;  //这样a变为最开始的b
//    printf("%d %d\n", a, b);
//    return 0;
//}


            //方法二，用异或
int main() {
    int a = 3, b = 5;
    a = a ^ b;   //a从011变成110
    b = a ^ b;   //b变成011     //因为俩次相同（或不同）就是抵消，因为b一直放在那，所以得到的是没一直放在那的原来的a
    a = a ^ b;   //同理，b变为011后，就变成101不在，所以a变为101
    printf("%d %d \n", a, b);
}











